COLORS_TO_SWITCH_RUDG = {(108, 64, 20): (0, 102, 0),  # Земля на траву из RUDG
                         (0, 255, 0): (255, 153, 204), # Деревья на куст из RUDG
                         (0, 153, 153): (102, 0, 0), # Столб? на бревно из RUDG
                         (0, 128, 255): (0, 0, 0), # Вода на ничего из RUDG
                         (0, 0, 255): (0, 0, 0), # Небо на ничего из RUDG
                         (101, 101, 11): (0, 0, 0), # Бетон на асфальт из RUDG
                         (255, 0, 127): (0, 0, 0), # Хз на ничего из RUDG
                         (153, 76, 0): (0, 102, 0), # Слой материала, нанесенный на почву на травуу из RUDG
                         (0, 255, 128): (0, 0, 0), # Велосипед на ничего из RUDG
                         (102, 0, 204): (102, 0, 0), # Забор на бревно из RUDG
                         (153, 204, 255): (102, 0, 0), # Скала, камень на бревно из RUDG
                         (102, 255, 255): (0, 0, 0), # Мост на ничего из RUDG
                         (114, 85, 47): (0, 0, 0) # Столик для пикника на ничего из RUDG
                         }

# Заменено 13 из 25, 8 отдельные классы, 4 основы для классов.
'''
Итоговые классы RUDG:       1) Пустота (0, 0, 0)
                            2) Растительность (0, 102, 0)
                            3) Песок (255, 229, 204)
                            4) Деревья/кусты (255, 153, 204)
                            5) Транспорт (255, 255, 0)
                            6) Асфальт (64, 64, 64)
                            7) Гравий (255, 128, 0)
                            8) Здание (255, 0, 0)
                            9) Каменная воперхность (102, 102, 0)
                            10) Препятствие (102, 0, 0)
                            11) Человек (204, 153, 255)
                            12) Знак (0, 102, 102)
'''
